БухЭксп/Catalogs/CW_ШаблоныДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ШаблоныДоговоров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеХарактеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОграниченСпискомЗначений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоставДаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ШаблоныДоговоров/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДобавленныеКолонки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонки()
	
	//Подсистема.ДополнительныеХарактиристикиДоговоров
	Для Каждого ТекущаяСтрока из Объект.ДополнительныеХарактеристики Цикл
		Параметр = ТекущаяСтрока.Параметр;
		ТекущаяСтрока.СоставДаты = CW_ДополнительныеХарактиристикиДоговоровСервер.ПолучитьСоставДатыСтроки(Параметр.ТипЗначения.КвалификаторыДаты.ЧастиДаты);
	КонецЦикла;
	//Подсистема.ДополнительныеХарактиристикиДоговоров
	
КонецПроцедуры

//Подсистема.ДополнительныеХарактиристикиДоговоров
&НаКлиенте
Процедура ДополнительныеХарактеристикиПараметрПриИзменении(Элемент)
	
	ОбработатьИзменениеПараметраНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеПараметраНаСервере()
	
	ИдентификаторСтроки = Элементы.ДополнительныеХарактеристики.ТекущаяСтрока;
	ТекущаяСтрока 		= Объект.ДополнительныеХарактеристики.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	ПараметрыОтбора = Новый Структура("Параметр", ТекущаяСтрока.Параметр);
	мСтроки = Объект.ДополнительныеХарактеристики.НайтиСтроки(ПараметрыОтбора);
	
	Если мСтроки.Количество() > 1 Тогда
		ТекущаяСтрока.Параметр = Неопределено;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбранный параметр уже есть в списке!");
	Иначе
		Если ЗначениеЗаполнено(ТекущаяСтрока.Параметр) Тогда
			CW_ДополнительныеХарактиристикиДоговоровСервер.ОбработатьДанныеСтроки(ТекущаяСтрока);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеХарактеристикиПараметрНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	CW_ДополнительныеХарактиристикиДоговоровКлиент.ПараметрНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеХарактеристикиЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПолучитьДанныеВыбораЗначения(ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеХарактеристикиЗначениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ПолучитьДанныеВыбораЗначения(ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеВыбораЗначения(ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДополнительныеХарактеристики.ТекущиеДанные;
	Если ТекущиеДанные.ОграниченСпискомЗначений Тогда
		ДанныеВыбора = ПолучитьСписокВыбораНаСервере();
		СтандартнаяОбработка = ДанныеВыбора = Неопределено;
	Конецесли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыбораНаСервере()
	
	мДоступныеЗначения = ПолучитьСписокВыбораПараметра();
	Если мДоступныеЗначения <> Неопределено Тогда
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.ЗагрузитьЗначения(мДоступныеЗначения);
		
		Возврат СписокВыбора;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокВыбораПараметра() Экспорт
	
	ИдентификаторСтроки = Элементы.ДополнительныеХарактеристики.ТекущаяСтрока;
	ТекущаяСтрока 		= Объект.ДополнительныеХарактеристики.НайтиПоИдентификатору(ИдентификаторСтроки);
	Параметр 			= ТекущаяСтрока.Параметр;
	
	Если Параметр.ОграниченСпискомЗначений Тогда
		мДоступноеЗначение = Параметр.ДоступныеЗначения.ВыгрузитьКолонку("ДоступноеЗначение");
		Возврат мДоступноеЗначение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ДополнительныеХарактеристикиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ = истина;
	Конецесли;
	
КонецПроцедуры
//Подсистема.ДополнительныеХарактиристикиДоговоров
